src/main/resources/crm.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions
        xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
        xmlns:tns="http://trustable.eu/soap/sample/ci"
        targetNamespace="http://trustable.eu/soap/sample/ci">

    <wsdl:import namespace="http://trustable.eu/soap/sample/ci" location="crm.xsd" />

    <wsdl:message name="getActiveCIByURLResponse">
        <wsdl:part element="tns:getActiveCIByURLResponse" name="getActiveCIByURLResponse">
        </wsdl:part>
    </wsdl:message>
    <wsdl:message name="getActiveCIByURLRequest">
        <wsdl:part element="tns:getActiveCIByURLRequest" name="getActiveCIByURLRequest">
        </wsdl:part>
    </wsdl:message>

    <wsdl:portType name="CiPort">
        <wsdl:operation name="getActiveCIByURL">
            <wsdl:input message="tns:getActiveCIByURLRequest" name="getActiveCIByURLRequest">
            </wsdl:input>
            <wsdl:output message="tns:getActiveCIByURLResponse" name="getActiveCIByURLResponse">
            </wsdl:output>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="CiPortSoap11" type="tns:CiPort">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
        <wsdl:operation name="getActiveCIByURL">
            <soap:operation soapAction="" />
            <wsdl:input name="getActiveCIByURLRequest">
                <soap:body use="literal" />
            </wsdl:input>
            <wsdl:output name="getActiveCIByURLResponse">
                <soap:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="CountriesPortService">
        <wsdl:port binding="tns:CiPortSoap11" name="CiPortSoap11">
            <soap:address location="http://localhost:8080/ws" />
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>