src/test/resources/bpmn/sample/soap/soapEnvelopeCiByURL.ftl

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ci="http://trustable.eu/soap/sample/ci">
    <soapenv:Header/>
    <soapenv:Body>
        <ci:getActiveCIByURLRequest>
            <ci:url>mail.trustable.eu</ci:url>
        </ci:getActiveCIByURLRequest>
    </soapenv:Body>
</soapenv:Envelope>
